Tekla Open API Reference for Tekla Structures 2025
AnalysisConnectivity Properties
The AnalysisConnectivity type exposes the following members.
Properties
Name | Description
Connectivity
 The connectivity type of the analysis connectivity.
Spring
 The spring values of the analysis connectivity.
Top
See Also
Reference
AnalysisConnectivity Class
Tekla.Structures.Analysis Namespace